KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьПрайсЛиста/КАНАТ_ПечатьПрайсЛиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ПечатьПрайсЛиста</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/InformationRegisters/ЦеныНоменклатуры25/ЦеныНоменклатуры25.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="60ff2f20-cb36-4ee2-aad8-4bd0327df594">
  <name>ЦеныНоменклатуры25</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="94221289-05e8-493f-b0bb-038570ca2c7d">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="73cfd776-be9d-497c-b1cf-50a4de2dd8c4">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b05ccc6e-8f9f-4ca0-ab35-15ac0e0299d5">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

KanatERPSukhova.КанатАдаптация/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c8a18d99-62ff-45a4-acb5-48e3310c1b53">
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Catalogs/КАНАТ_НастройкиПечатиПрайсЛиста/КАНАТ_НастройкиПечатиПрайсЛиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КАНАТ_НастройкиПечатиПрайсЛиста</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользоватьПриПечати</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметр1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметр10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСортировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСкидки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ПечатьПрайсЛиста/Forms/ОсновнаяФорма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЗаполнитьНастройкиПрайсЛиста();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПрайсЛиста() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Наименование КАК Наименование,
		|	ЛОЖЬ КАК Печатать,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Ссылка КАК Ссылка,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр1 КАК Параметр1,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр2 КАК Параметр2,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр3 КАК Параметр3,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр4 КАК Параметр4,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр5 КАК Параметр5,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр6 КАК Параметр6,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр7 КАК Параметр7,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр8 КАК Параметр8,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр9 КАК Параметр9,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр10 КАК Параметр10,
		|	ВидыЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.ПоказыватьСкидки КАК ПоказыватьСкидки
		|ИЗ
		|	Справочник.КАНАТ_НастройкиПечатиПрайсЛиста КАК КАНАТ_НастройкиПечатиПрайсЛиста,
		|	Константа.КАНАТ_ВидЦенДляПрайсЛиста КАК КАНАТ_ВидЦенДляПрайсЛиста
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК ВидыЦен
		|		ПО КАНАТ_ВидЦенДляПрайсЛиста.Значение = ВидыЦен.Ссылка
		|ГДЕ
		|	КАНАТ_НастройкиПечатиПрайсЛиста.ЭтоГруппа = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из РезультатЗапроса Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Ссылка", Строка.Ссылка);
		
		НайденныеСтроки = НастройкаПечатиПрайсЛиста.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			
			Строка.Печатать = НайденныеСтроки[0].Печатать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НастройкаПечатиПрайсЛиста.Очистить();
	НастройкаПечатиПрайсЛиста.Загрузить(РезультатЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	МассивТабДок = ПечатьНаСервере();
	Если МассивТабдок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Идентификатор = СтрЗаменить(МассивТабдок[0].Группа, ",", ""); //БИТ_Гурьев_Правки прайс листа_29.11.24
	Идентификатор = СтрЗаменить(Идентификатор,"""","""""");
	Для Счетчик = 1 По МассивТабДок.Количество()-1 Цикл
		
		Идентификатор = Идентификатор + "," + СтрЗаменить(МассивТабдок[Счетчик].Группа, ",", ""); //БИТ_Гурьев_Правки прайс листа_29.11.24
		Идентификатор = СтрЗаменить(Идентификатор,"""","""""");
	КонецЦикла;
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	Для Счетчик = 0 По МассивТабДок.Количество()-1 Цикл
		
		КоллекцияПечатныхФорм[Счетчик].ТабличныйДокумент = МассивТабДок[Счетчик].ТабДок;
		КоллекцияПечатныхФорм[Счетчик].Экземпляров = 1;
		КоллекцияПечатныхФорм[Счетчик].СинонимМакета = МассивТабдок[Счетчик].Группа;
		
	КонецЦикла;

	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	МассивТабДок = Новый Массив;
	МассивВыводимыхГрупп = Новый Массив;
	
	Для Каждого Группа Из НастройкаПечатиПрайсЛиста Цикл
		ЦенаВключаетНДС = Группа.ЦенаВключаетНДС;
		Если Группа.Печатать Тогда
			МассивВыводимыхГрупп.Добавить(Группа.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеПечати = ПолучитьДанныеПечати(МассивВыводимыхГрупп);
	
	ВыборкаРодитель = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ПечатьПрайсЛиста.МакетПечатиПрайсЛиста");
	Пока ВыборкаРодитель.Следующий() Цикл
		
		ТабДок = Новый ТабличныйДокумент;
		Табдок.АвтоМасштаб = Истина;
		
		Родитель = ВыборкаРодитель.Родитель;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Ссылка", Родитель);
		МассивПараметрыГруппы = НастройкаПечатиПрайсЛиста.НайтиСтроки(СтруктураПоиска);
		
		Если МассивПараметрыГруппы.Количество() < 1 Тогда
			Сообщить("Для" + Строка(Родитель) + "вывод печатной формы невозможен. Нет данных на форме.");
			Продолжить;
		КонецЕсли;
		
		Если МассивПараметрыГруппы.Количество() > 1 Тогда
			Сообщить("Для" + Строка(Родитель) + "вывод печатной формы невозможен. Слишком много данных на форме.");
			Продолжить;
		КонецЕсли;
		
		ПараметрыГруппы = МассивПараметрыГруппы[0];
		МассивИспользуемыхПараметров = Новый Массив;
		
		ОбластьШапка = Новый ТабличныйДокумент;
		ОбластьШапкаЛево = Макет.ПолучитьОбласть("ОбластьШапкаЛево");
		ОбластьШапкаПраво = Макет.ПолучитьОбласть("ОбластьШапкаПраво");
		
		
		ОбластьНазванияПараметров = Новый ТабличныйДокумент;
		Отступ = Макет.ПолучитьОбласть("Отступ");
		ОбластьНазванияПараметров.Присоединить(Отступ);
		
		Для Счетчик = 1 по 10 Цикл
			
			ИмяПараметра = "Параметр" + Строка(Счетчик);
			Если ТипЗнч(ПараметрыГруппы[ИмяПараметра]) = Тип("Строка") 
				И ПараметрыГруппы[ИмяПараметра] <> "" Тогда
				
				МассивИспользуемыхПараметров.Добавить(Счетчик);
				
				ОбластьНазваниеПараметра = Макет.ПолучитьОбласть("ОбластьНазваниеПараметра");
				ОбластьНазваниеПараметра.Параметры.НазваниеПараметра = ПараметрыГруппы[ИмяПараметра];
				
				ОбластьНазванияПараметров.Присоединить(ОбластьНазваниеПараметра);	
			КонецЕсли;
			
		КонецЦикла;
		
		КоличествоИспользуемыхСтолбцов = МассивИспользуемыхПараметров.Количество() + 1; 
		
		ОбластьШапкаЦена = Макет.ПолучитьОбласть("ОбластьШапкаЦена");
		ОбластьНазванияПараметров.Присоединить(ОбластьШапкаЦена);
		
		Если Не ЦенаВключаетНДС Тогда
			
			ОбластьШапкаЦенаСНДС = Макет.ПолучитьОбласть("ОбластьШапкаЦенаСНДС");
			ОбластьНазванияПараметров.Присоединить(ОбластьШапкаЦенаСНДС);
			
			КоличествоИспользуемыхСтолбцов = КоличествоИспользуемыхСтолбцов + 1;
			
		КонецЕсли;
		
		ДанныеОрганизации = ПолучитьДанныеОрганизации();
		Если ДанныеОрганизации <> Неопределено Тогда
			
			НаименованиеОрганизации = ДанныеОрганизации.Наименование;
			Контакты = ДанныеОрганизации.Контакты;
			
			СтрокаФакс = Контакты.Найти(Перечисления.ТипыКонтактнойИнформации.Факс, "Тип");
			
			Факс = "";
			
			Если СтрокаФакс <> Неопределено Тогда
				Факс = "Факс: " + СтрокаФакс.Представление;
			КонецЕсли;
			
			СтрокаПочта = Контакты.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, "Тип");
			
			Почта = "";
			
			Если СтрокаПочта <> Неопределено Тогда
				Почта = "E-mail: " + СтрокаПочта.Представление + Символы.ПС + "www.kanat-kolomna.ru";
			Иначе
				Почта = "www.kanat-kolomna.ru";
			КонецЕсли;
			
			ОбластьШапкаЛево.Параметры.ИмяИФакс = НаименованиеОрганизации + Символы.ПС + Факс;
			ОбластьШапкаПраво.Параметры.ПочтаСсылка = Почта;
			ОбластьШапкаПраво.Параметры.НаименованиеГруппы = МассивПараметрыГруппы[0].Наименование;
			
		КонецЕсли;
		
		ОбластьШапка.Присоединить(Отступ);
		ОбластьШапка.Присоединить(ОбластьШапкаЛево);
		Для Счетчик = 2 По КоличествоИспользуемыхСтолбцов - 1 Цикл
			
			ОбластьШапка.Присоединить(ОбластьШапкаПраво);
			
		КонецЦикла;
		
		ОбластьШапка.Присоединить(ОбластьШапкаПраво);
		ОбластьШапка.Область(1,3,1,1 + КоличествоИспользуемыхСтолбцов).Объединить();
		ОбластьШапка.Область(1,3,1,1 + КоличествоИспользуемыхСтолбцов).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьШапка.Область(2,3,3,1 + КоличествоИспользуемыхСтолбцов).Объединить();
		ОбластьШапка.Область(2,3,3,1 + КоличествоИспользуемыхСтолбцов).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьШапка.Область(4,2,4,1 + КоличествоИспользуемыхСтолбцов/2).Объединить();
		ОбластьШапка.Область(4,2,4,1 + КоличествоИспользуемыхСтолбцов/2).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьШапка.Область(4,1 + КоличествоИспользуемыхСтолбцов/2 + 1,4,1 + КоличествоИспользуемыхСтолбцов).Объединить();
		ОбластьШапка.Область(4,1 + КоличествоИспользуемыхСтолбцов/2 + 1,4,1 + КоличествоИспользуемыхСтолбцов).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ТабДок.Вывести(ОбластьШапка);
		
		ТабДок.Вывести(ОбластьНазванияПараметров);															
																	
		ВыборкаНаименование = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаНаименование.Следующий() Цикл
			
			ОбластьТовар = Новый ТабличныйДокумент;
			Отступ = Макет.ПолучитьОбласть("Отступ");
			ОбластьТовар.Присоединить(Отступ);
			ОбластьНаименованиеТовара = Макет.ПолучитьОбласть("ОбластьНаименованиеТовара");
			ОбластьНаименованиеТовара.Параметры.НаименованиеТовара = ВыборкаНаименование.Наименование;
			ОбластьНаименованиеТовара.Область(1,1,1,КоличествоИспользуемыхСтолбцов).Объединить();
			ОбластьНаименованиеТовара.Область(1,1,1,КоличествоИспользуемыхСтолбцов).Обвести(
																Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная),
																Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная),
																Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная),
																Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная));
																
			ОбластьТовар.Присоединить(ОбластьНаименованиеТовара);													
			ТабДок.Вывести(ОбластьТовар);
			
			ВыборкаДетальныеЗаписи = ВыборкаНаименование.Выбрать();
	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ТабДокСтрокаТаблицы = Новый ТабличныйДокумент;
				Отступ = Макет.ПолучитьОбласть("Отступ");
				ТабДокСтрокаТаблицы.Присоединить(Отступ);
				
				Для Каждого НомерПараметра Из МассивИспользуемыхПараметров Цикл
					
					ИмяПараметра = "Параметр" + Строка(НомерПараметра);
					ОбластьЗначениеПараметра = Макет.ПолучитьОбласть("ОбластьЗначениеПараметра");
					ОбластьЗначениеПараметра.Параметры.ЗначениеПараметра = ВыборкаДетальныеЗаписи[ИмяПараметра];
					ТабДокСтрокаТаблицы.Присоединить(ОбластьЗначениеПараметра);
					
				КонецЦикла; 
				
				ОбластьЗначениеЦена = Макет.ПолучитьОбласть("ОбластьЗначениеЦена");
				ОбластьЗначениеЦена.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена;
				ТабДокСтрокаТаблицы.Присоединить(ОбластьЗначениеЦена);
				
				Если Не ЦенаВключаетНДС Тогда
					
					ОбластьЗначениеЦена = Макет.ПолучитьОбласть("ОбластьЗначениеЦена");
					ОбластьЗначениеЦена.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена * 1.2;
					ТабДокСтрокаТаблицы.Присоединить(ОбластьЗначениеЦена);	
					
				КонецЕсли;
				
				ТабДок.Вывести(ТабДокСтрокаТаблицы);
				
			КонецЦикла;
		КонецЦикла;
		
		Если ВыводитьСкидки И ПараметрыГруппы.ПоказыватьСкидки Тогда
			
			Скидки = ДействиеСкидокНаценокПоИсточнику(Константы.КАНАТ_СоглашениеДляТиповогоТекстаСкидок.Получить(), ТекущаяДата());
			Если Скидки.Количество() > 0 Тогда
				
				Область = Макет.ПолучитьОбласть("СкидкиЗаголовок");
				ТабДок.Вывести(Область);
				
				Для Каждого Скидка Из Скидки Цикл
					
					Область = Макет.ПолучитьОбласть("СкидкиТекст");
					Область.Параметры.ТекстСкидки = Скидка.Наименование + ";";
					ТабДок.Вывести(Область);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Структура = Новый Структура;
		Структура.Вставить("Группа", ПараметрыГруппы.Наименование);
		Структура.Вставить("ТабДок", ТабДок);
		
		МассивТабДок.Добавить(Структура);
	КонецЦикла; 
	
	Возврат МассивТабДок;

КонецФункции

&НаСервере
Функция ПолучитьДанныеПечати(МассивВыводимыхГрупп)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЦеныНоменклатуры25СрезПоследних.Цена) КАК Цена,
		|	ЦеныНоменклатуры25СрезПоследних.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ Вт
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних КАК ЦеныНоменклатуры25СрезПоследних
		|ГДЕ
		|	ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатуры25СрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Наименование КАК Наименование,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр1 КАК Параметр1,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр2 КАК Параметр2,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр3 КАК Параметр3,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр4 КАК Параметр4,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр5 КАК Параметр5,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр6 КАК Параметр6,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр7 КАК Параметр7,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр8 КАК Параметр8,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр9 КАК Параметр9,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Параметр10 КАК Параметр10,
		|	КАНАТ_НастройкиПечатиПрайсЛиста.Родитель КАК Родитель,
		|	ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	Справочник.КАНАТ_НастройкиПечатиПрайсЛиста КАК КАНАТ_НастройкиПечатиПрайсЛиста
		|		ЛЕВОЕ СОЕДИНЕНИЕ Вт КАК ЦеныНоменклатуры25СрезПоследних
		|		ПО КАНАТ_НастройкиПечатиПрайсЛиста.Товар = ЦеныНоменклатуры25СрезПоследних.Номенклатура
		|ГДЕ
		|	КАНАТ_НастройкиПечатиПрайсЛиста.ИспользоватьПриПечати = ИСТИНА
		|	И КАНАТ_НастройкиПечатиПрайсЛиста.Родитель В(&МассивВыводимыхГрупп)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КАНАТ_НастройкиПечатиПрайсЛиста.ПорядокСортировки
		|ИТОГИ ПО
		|	Родитель,
		|	Наименование";
	
	Запрос.УстановитьПараметр("МассивВыводимыхГрупп", МассивВыводимыхГрупп);
	Запрос.УстановитьПараметр("ВидЦены", Константы.КАНАТ_ВидЦенДляПрайсЛиста.Получить());
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервере
Функция ДействиеСкидокНаценокПоИсточнику(Источник, Дата)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка                                                              КАК СкидкаНаценка,
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) КАК Статус,
	|	
	|	ВЫБОР
	|		КОГДА ДействиеСкидокНаценокСрезПоследних.Статус ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Использование,
	|	
	|	ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	|	
	|	ВЫБОР КОГДА ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL ТОГДА
	|		ЕСТЬNULL(ДобавитьКДате(ДействиеСкидокНаценокСрезПервых.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1)) 
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДобавитьКДате(Таблица.Период, ДЕНЬ, -1), ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаОкончания,
	|	ТаблицаСкидкиНаценки.Наименование КАК Наименование
	|	
	|ИЗ
	|	Справочник.СкидкиНаценки КАК ТаблицаСкидкиНаценки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК ДействиеСкидокНаценокСрезПоследних
	|			ПО ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МИНИМУМ(Т.Период) КАК Период,
	|			Т.СкидкаНаценка КАК СкидкаНаценка
	|		ИЗ
	|			РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(&ДатаСреза, Источник = &Источник) КАК Срез
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок КАК Т
	|				ПО (Т.СкидкаНаценка = Срез.СкидкаНаценка)
	|					И Т.Источник = Срез.Источник
	|					И Т.Период > Срез.Период
	|					И Т.Статус <> Срез.Статус
	|		СГРУППИРОВАТЬ ПО
	|			Т.СкидкаНаценка) КАК Таблица
	|		ПО (Таблица.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок.СрезПервых(
	|				&ДатаСреза,
	|				Источник = &Источник) КАК ДействиеСкидокНаценокСрезПервых
	|		ПО ДействиеСкидокНаценокСрезПервых.СкидкаНаценка = ТаблицаСкидкиНаценки.Ссылка
	|ГДЕ
	|	    (НЕ ДействиеСкидокНаценокСрезПоследних.Период ЕСТЬ NULL
	|	ИЛИ НЕ ДействиеСкидокНаценокСрезПервых.Период ЕСТЬ NULL)
	|	И ЕСТЬNULL(ДействиеСкидокНаценокСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.НеДействует)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
	|");
	
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Источник", Источник);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	НастройкаПечатиПрайсЛиста.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ЗаполнитьНастройкиПрайсЛиста();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для Каждого Строка Из НастройкаПечатиПрайсЛиста Цикл
		
		Строка.Печатать = Истина;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыбор(Команда)
	
	Для Каждого Строка Из НастройкаПечатиПрайсЛиста Цикл
		
		Строка.Печатать = Ложь;	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройкиПечати(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыводаПрайсЛиста", ЭтотОбъект);
	ОткрытьФорму("Справочник.КАНАТ_НастройкиПечатиПрайсЛиста.ФормаСписка",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыводаПрайсЛиста(Результат, ДопПараметры) Экспорт
	
	ЗаполнитьНастройкиПрайсЛиста();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОрганизации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	Организации.Ссылка КАК Ссылка,
|	Организации.НаименованиеПолное КАК Наименование
|	ИЗ
|		Справочник.Организации КАК Организации
|	ГДЕ
|		Организации.Предопределенный = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Структура = Новый Структура;
		Структура.Вставить("Наименование", Выборка.Наименование);
		Структура.Вставить("Контакты", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.Ссылка,,ТекущаяДата(),Ложь));
		
		Возврат Структура;
		
	Иначе 
		
		Возврат Неопределено;
		
	КонецЕсли;
КонецФункции
